 let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => m.reply(`

*💥❯══⊹⊱≼ اوامر البوت ≽⊰⊹══❮💥*

*❑ ☻اسم البوت: ⊀ﺷﻋﺑوﻃ*
*❑ حط قبل كل امر : .*
*❑ اســم الـمطور : ﮼♪الصاعـ|ـقة⁞¹²*
*❑ البوت شغـال 24 ساعة*
*❑ الـمنـصه : هيركو*


*قســـــم_الجروبــــــات👥*
      ╔════◎▣════╗
*〄━━┋ اوامر الـج👥ـروبات┋━━〄*

*↫❍┋المجموعة*
*↫❍┋تحقق*
*↫❍┋تحويل2* 
*↫❍┋طرد*
*↫❍┋ترقية*
*↫❍┋اعفاء*
*↫❍┋انذار*
*↫❍┋الانذارات*
*↫❍┋حذف_تحذير*
*↫❍┋حذف*
*↫❍┋منشن*
*↫❍┋مخفي*
*↫❍┋المشرفين*
*↫❍┋لمنشن*
*↫❍┋بروفايل*
*↫❍┋الجروب*
*↫❍┋اطفاء*
*↫❍┋اعادة*
*↫❍┋اعدادات*
*↫❍┋جروب*
*↫❍┋تغيرالاسم*
*↫❍┋تغيرالوصف*
*↫❍┋رابط*
*↫❍┋جروب قفل / فتح*
*↫❍┋فحص*
*↫❍┋معلومات*
*↫❍┋قائمة_الارقام*
*↫❍┋طرد_رقم*
*↫❍┋المجموعات*
*↫❍┋توضيح - هو مضاد فيروس.*

*💥❯══⊹⊱≼≽⊰⊹══❮💥*

 *❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
_*⌬━━┋قسم الـمطـور فـقط ┋━━⌬*_

*↫❍┋قيد*
*↫❍┋الغاءالقيد*
*↫❍┋اطفاء*
*↫❍┋تفعيل*
*↫❍┋إعادةالتعين*
*↫❍┋اخرج*
*↫❍┋انضم*
*↫❍┋تفقد_المده*
*↫❍┋حذف_المده*
*↫❍┋بريم*
*↫❍┋حذف_بريميام*
*↫❍┋حظر*
*↫❍┋الغاءالحظر*
*↫❍┋المحظورين*
*↫❍┋المبندين*
*↫❍┋المميزين*
*↫❍┋البلوكات*
*↫❍┋اعلان*
*↫❍┋اعادةالتشغيل*
*↫❍┋اصلح*
*↫❍┋مسح_السجلات*
*↫❍┋سيرفر*
*↫❍┋قائمة_المميزين*
*↫❍┋بينج*
*💥❯═⊹⊱≼≽⊰⊹══❮💥*


*❆❯══⊹⊱≼ ❄️ ≽⊰⊹═══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
*〄━━┋ قسم البحث & الـتـنزيـل ┋━━〄*
*↫❍┋تحميل*
*↫❍┋تلجراف*
*↫❍┋تنزيل*
*↫❍┋بحث*
*↫❍┋فيس*
*↫❍┋فيس3*
*↫❍┋انستغرام*
*↫❍┋انستا*
*↫❍┋ميديافاير*
*↫❍┋جوجل*
*↫❍┋تيك*
*↫❍┋تيك2*
*↫❍┋تيك3*
*↫❍┋تويتر*
*↫❍┋اغنية*
*↫❍┋شغل*
*↫❍┋فيديو*
*↫❍┋فيد*
*↫❍┋افلام*
*↫❍┋تطبيق*
*↫❍┋صور*
*↫❍┋2صور*
*↫❍┋صوره*
*↫❍┋كورة-مباريات*
*↫❍┋معرفة*

_*〄━┋🙈قسـم,التسلية,والمرح┋━〄*_
*↫❍┋انطق*
*↫❍┋صداقة*
*↫❍┋خلفيه*
*↫❍┋الحب*
*↫❍┋طلاق*
*↫❍┋منشني*
*↫❍┋تخمين*
*↫❍┋مقولات*
*↫❍┋خيار*
*↫❍┋هل*
*↫❍┋ورع*
*↫❍┋جميل*
*↫❍┋خروف*
*↫❍┋شخصية*
*↫❍┋بوستات*
*↫❍┋رعب*
*↫❍┋زواج*
*↫❍┋زوجني*
*↫❍┋اسال*
*↫❍┋استخراج*
*↫❍┋شبيهي*
*↫❍┋زعلانه*
*↫❍┋عيوشه*
*↫❍┋عمري*

*💥❯══⊹⊱≼≽⊰⊹══❮💥*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
_*⌬━━┋ قسم الالعاب  ┋━━⌬*_
 *¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤*
*↫❍┋لعبة*
*↫❍┋سؤال*
*↫❍┋رياضه*
*↫❍┋تخمين2*
*↫❍┋توقع*
*↫❍┋لغز*
*↫❍┋دين*
*↫❍┋شرح_مونوبلي*
*↫❍┋مسابقة*
*↫❍┋مزيف*
*↫❍┋تاج*
*↫❍┋حروف*
*↫❍┋جريمة*
*↫❍┋حفر*
*↫❍┋تسجيل*
*↫❍┋حوالة*
*↫❍┋متفجرات*
 *❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
_*⌬━━┋ إضافات اوامر حصريه ┋━━⌬*_
 *¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤*
*↫❍┋بريد*
*↫❍┋لوجو*
*↫❍┋اختصار*
*↫❍┋معلومه*
*↫❍┋رفع*
*↫❍┋كورة*
*↫❍┋ءbobizaaii*
*↫❍┋اخبار*
*↫❍┋الانترنت*
*↫❍┋اخرالاخبار*
*↫❍┋ءpdf*
*↫❍┋كشف*
*💥❯══⊹⊱≼≽⊰⊹══❮💥*

  *❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
_*〄━┋ قسم الذكاء الاصطناعي┋━〄*_

*↫❍┋استمع*
*↫❍┋رعب*
*↫❍┋بوت*
*↫❍┋تويت*
*↫❍┋تصميم*
*↫❍┋تحليل*
*↫❍┋كرتون*
*↫❍┋لانمي*
*↫❍┋مساعد*
*↫❍┋بي_دي_اف*
*↫❍┋انطق*
*↫❍┋انطق2*
*↫❍┋برمجة*
*↫❍┋اختصار*
*↫❍┋شعبوط*
*↫❍┋خط*
*↫❍┋واتساب*
*↫❍┋تحدث*
*💥❯══⊹⊱≼≽⊰⊹══❮💥*

   *❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
_*〄━━┋قسم الـتحـويل ┋━━〄*_
*↫❍┋تشويش*
*↫❍┋ملصق*
*↫❍┋س*
*↫❍┋لفيديو*
*↫❍┋لصورة*
*↫❍┋لصوت*
*↫❍┋لوجو*
*↫❍┋دمج*
*↫❍┋لجواهر*
*↫❍┋ستك*
*↫❍┋ستيكر+1+2+3+4+5+6*
*↫❍┋س1*
*↫❍┋قبلة*
*↫❍┋تاثير*
*↫❍┋ايموجي*
*💥❯══⊹⊱≼ ≽⊰⊹══❮💥*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
*〄━━┋ قسم الاسلام ┋━━〄*
*↫❍┋آالصلاة*
*↫❍┋سورة*
*↫❍┋قران*
*↫❍┋دين*
*↫❍┋ايات*
*↫❍┋حديث*
*↫❍┋دعاء*
*↫❍┋الله*
*↫❍┋اذكار الصباح*
*↫❍┋اذكار المساء*
*↫❍┋استغفار*
*┑━━━┇حـقـوق الـمـطـور┇━━━┍*
*│⇆ رقـم الـمطـور : ↯*
*│ده : https://wa.me/+967733875056
*┙━━━┇حـقـوق الـمـطـور┇━━━┕*
*💥❯══⊹⊱≼≽⊰⊹══❮💥*

`.trim())
handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['اوامر','menu','الاوامر'] 

export default handler
