let handler = m => m 
 handler.all = async function (m) { 
 let chat = global.db.data.chats[m.chat] 
  
   if (/^اذكار الصباح|أذكار الصباح$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, ` .☀🌹 أذكارالصباح🌹☀

🌴 حصن نفسك حصن نفسك🌴
💐 الحمد لله وحده ، والصلاة والسلام على من لا نبي بعده:

♡[ آية الكرسي]
♡ سورة الإخلاص-ثلاث مرات]
♡[ سورة الفلق-ثلاث مرات]
♡ سورة الناس-ثلاث مرات]

💐 أصبحنا وأصبح الملك لله ، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر .

💐 "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت  وإليك النشور

💐 "اللهم أنت ربي لا إله إلا أنت خَلَقتني وأنا عَبْدُك وأنا على عهدك ووعدك ما استطعت وأعوذ بك من شر ما صنعت أبوء لك بنعمتك على وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت

💐 اللهم إني أصبحت أشهدك وأشهد حملة عرشك ، وملائكتك وجميع خلقك ، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك"( أربع مرات)

💐 "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك ، فلك الحمد ولك الشكر "

💐 "اللهم عافني في بَدَني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت .اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت"( ثلاث مرات)

💐 ؛" حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم "( سبع مرات )

💐 "اللهم إني أسألك العافية في الدنيا والآخرة،اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي،اللهم استر عوراتي وآمن روعاتي، اللهم أحفظني من بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي" .  

💐 "اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم"

💐 "بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم( "ثلاث مرات)

💐 "رضيت بالله رباً ، وبالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً"( ثلاث مرات)

💐 "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كُله ولا تَكِلْني إلى نفسي طرفة عين"

💐 "أصبحنا وأصبح الملك لله رب العالمين ، اللهم إني أسألك خير هذا اليوم : فتحه ، ونصره ،ونوره ،وبركته، وهداه، وأعوذ بك من شر ما فيها وشر ما بعده"

💐 "(أصبحنا على فطرة الإسلام وكلمة الإخلاص، ودين نبيَّنا محمد صلى الله عليه وسلم وملَّة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين"

💐 "سبحان الله وبحمده"( مائة مرة )

💐 "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير"( عشر مرات)

💐 "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير" 
( مائة مرة )

💐 "سبحان الله وبحمده عدد خلقهِ ورِضَا نفسِهِ وزِنُة عَرشِهِ ومِداد كلماته"( ثلاث بعد صلاة الفجر)
💐 عوذ بكلمات الله التامات من شر ماخلق ( ثلاث مرات)
💐 "أستغفر الله وأتوب إليه "(  مائة مرة في اليوم)

💐 الصلاه على النبي (عشر مرات) `, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
     
 if (/^مكتب اشرف$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `🌍 **وكالة أشرف للسفريات وخدمات الحج والعمرة** 🕋  

✈️ **خدماتنا:**  
- حجز تذاكر طيران لجميع دول العالم 🌏  
- حجز تذاكر النقل بالحافلات للمملكة العربية السعودية وسلطنة عمان والإمارات 🚌  
- تأجير سيارات لنقل خاص وحجز مقاعد إلى المملكة وعمان وأبوظبي 🚗  
- تأشيرات علاجية وسياحية وتجارية ودراسية لدول عدة 🛂  
- تأشيرة عبور لسلطنة عمان 🇴🇲  
- اصدار تأشيرات زيارة سياحية 🏖️  
- تخليص تأشيرات عمل وزيارات عائلية وعمرة 🕋  
- خدمات الشحن من الصين 📦  
- خدمات البريد للسعودية وعمان والإمارات 📩  
- اصدار جوازات بدون حضور 🛂  
- اصدار تقارير طبية 📅  
- قسم عقاري لبيع وشراء الأراضي والمنازل 🏘️  

📞 **للتواصل والاستفسار:**  
- 777133112  
- 735149246  
- 711604815  
- 04/435290  

📍 **العنوان:**  
المكتب الرئيسي: إب/عقبة القاعدة جوار محطة أشرف  
تعز، الذكرة، جولة الستين الشارع العام  

💬 **فضلاً نشر البرشور على الجروب والمواقع الأخرى  🌟💎
ً `, m) //wm, null, [['Menu', '#menu']], m) botones :V 

   } 
  
 if (/^دعاء$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `🌴دعاء الخروج من المنزل🌴 

عن أنس بن مالك رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: مَنْ قالَ يعني إذا خرج من بيته باسْمِ اللَّهِ تَوَكَّلْتُ على اللَّهِ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ باللَّهِ يُقالُ لَهُ: كُفِيتَ وَوُقِيتَ وَهُدِيتَ فَتَتَنَحَّى لَهُ الشَّيَاطِينُ فَيَقُولُ لَهُ شَيطَانٌ آخَرُ: كَيْفَ لَكَ بِرَجُلٍ قَدْ 
هُدِيَ وكُفِيَ وَوُقِي

َ
[ رواه أبو داود (٥٠٩٥) 

يقال حينئذ: أي يناديه ملك يا عبد الله هُديت: بصيغة المجهول أي طريق الحق وكُفيت: أي هَمَّك وَوُقيت: من الوقاية أي حُفِظت`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
 return !0 } 
 export default handler